English/NCE2/L22 A glass envelope.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-06 Tue 22:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org1333093" class="outline-2">
<h2 id="org1333093">Lesson 22 A glass envelope</h2>
<div class="outline-text-2" id="text-org1333093">
<p class="verse">
How did Jane receive a letter from a stranger?<br />
<br />
My daughter, Jane, never <b>dreamed of receiving</b> a letter from a girl <b>of her own age</b> in Holland.<br />
Last year, we were travelling across the Channel<br />
&#xa0;and Jane put a piece of paper with her name and address on it into a bottle.<br />
She threw the bottle into the sea.<br />
She never <b>thought of</b> it again,<br />
&#xa0;but ten months later, she received a letter from a girl in Holland.<br />
Both girls <b>write to each other</b> regularly now.<br />
However, they have <b>decided to use</b> the post office.<br />
Letters will cost a little more,<br />
&#xa0;but they will certainly travel faster.<br />
</p>
</div>
<div id="outline-container-orgeb1487f" class="outline-3">
<h3 id="orgeb1487f">expression</h3>
<div class="outline-text-3" id="text-orgeb1487f">
<p>
dream [driːm] v.做梦,梦想<br />
age [eɪdʒ] n.年龄<br />
channel [ˈtʃæn(ə)l] n.海峡<br />
throw [θrəʊ] threw [θruː] thrown [θrəʊn] v.扔,抛<br />
regularly [ˈreɡjələli] adv.有规律地<br />
</p>

<p>
dream of doing sth. 梦想做某事<br />
at my age 以我的年纪<br />
throw away 丢弃<br />
</p>

<hr />
<p>
v. + of/from/in/on<br />
</p>

<p>
think of sth. 考虑某事<br />
write to sb. 写给某人<br />
decide to do sth. 决定做某事<br />
</p>
</div>
</div>


<div id="outline-container-org73190af" class="outline-3">
<h3 id="org73190af">单词造句</h3>
</div>
<div id="outline-container-org53a9e9f" class="outline-3">
<h3 id="org53a9e9f">反复听电影片段</h3>
</div>
<div id="outline-container-org85c40ea" class="outline-3">
<h3 id="org85c40ea">Pattern Drill 写+读</h3>
</div>
<div id="outline-container-org141b43f" class="outline-3">
<h3 id="org141b43f">给自己讲解</h3>
</div>
<div id="outline-container-org14738e8" class="outline-3">
<h3 id="org14738e8">红皮书</h3>
</div>
<div id="outline-container-org94831bd" class="outline-3">
<h3 id="org94831bd">习惯用法造句</h3>
</div>
<div id="outline-container-org13fa0b6" class="outline-3">
<h3 id="org13fa0b6">跟读至背诵</h3>
</div>
<div id="outline-container-orgd4911dc" class="outline-3">
<h3 id="orgd4911dc">Ask me if 写+读</h3>
</div>
<div id="outline-container-orge97a42a" class="outline-3">
<h3 id="orge97a42a">摘要写作</h3>
</div>
<div id="outline-container-orge3ca800" class="outline-3">
<h3 id="orge3ca800">tell the story 口语</h3>
</div>
<div id="outline-container-org39c4028" class="outline-3">
<h3 id="org39c4028">Topics for discussion</h3>
<div class="outline-text-3" id="text-org39c4028">
<p>
Imagine a situation when it might be necessary to send a message in a bottle.<br />
Students in England often work for the post office during the Christmas holidays. What sorts of jobs do students in your country do during their vacations?<br />
</p>
</div>
</div>
</div>
</div>
</body>
</html>
